benchmark/results_get_details/get-details-c16-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   223.55ms  252.76ms   1.49s    80.78%
    Req/Sec    26.20     18.20    60.00     58.23%
  Latency Distribution
     50%   48.27ms
     75%  419.63ms
     90%  624.07ms
     99%  803.32ms
  1071 requests in 10.01s, 832.98KB read
Requests/sec:    106.95
Transfer/sec:     83.18KB