benchmark/results_get_details/get-details-c16-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   231.47ms  261.73ms   1.70s    81.23%
    Req/Sec    29.12     19.79    60.00     47.28%
  Latency Distribution
     50%   52.70ms
     75%  438.70ms
     90%  632.79ms
     99%  792.29ms
  1046 requests in 10.01s, 813.54KB read
Requests/sec:    104.47
Transfer/sec:     81.25KB