benchmark/results_get_details/get-details-c32-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   337.77ms  338.17ms   1.31s    78.36%
    Req/Sec    36.60     32.19   121.00     62.33%
  Latency Distribution
     50%   75.09ms
     75%  592.48ms
     90%  872.52ms
     99%    1.01s 
  1068 requests in 10.01s, 830.65KB read
Requests/sec:    106.67
Transfer/sec:     82.97KB