benchmark/results_get_details/get-details-c8-d10s.txt
Running 10s test @ http://localhost:5000
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   125.21ms  145.53ms 550.53ms   81.56%
    Req/Sec    18.92      9.28    30.00     54.55%
  Latency Distribution
     50%   42.11ms
     75%  178.07ms
     90%  376.54ms
     99%  531.23ms
  1020 requests in 10.01s, 793.32KB read
Requests/sec:    101.88
Transfer/sec:     79.24KB